In [1]:
# Pandas
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine

import psycopg2

from config import postgres_password

In [5]:
# Postgres username, password, and database name 
POSTGRES_ADDRESS = 'localhost'
POSTGRES_PORT = '5432' 
POSTGRES_USERNAME = 'postgres'
POSTGRES_PASSWORD = postgres_password
POSTGRES_DBNAME = 'testing'

#engine = create_engine('postgresql://localhost:5432/testing')
#engine = create_engine('postgresql://postgres:{POSTGRES_PASSWORD}@localhost:5432/testing')
# A long string that contains the necessary Postgres login information 
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
               .format(username=POSTGRES_USERNAME, 
                       password=POSTGRES_PASSWORD, 
                       ipaddress=POSTGRES_ADDRESS, 
                       port=POSTGRES_PORT, 
                       dbname=POSTGRES_DBNAME))

engine = create_engine(postgres_str)    
connection = engine.connect()

In [6]:
# Query All Records in the the Database
data = pd.read_sql('SELECT * FROM "Employees";', connection)

In [7]:
data.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18